# -*- coding:utf-8 -*- 
def modify_num(num):
    num = num.replace('(', '')
    num = num.replace(')', '')
    num = num.replace(' ', '')
    just_num = num.replace(',', '')
    starting_point = 0
    for i in range(len(just_num)):
        if just_num[i] == '0' or just_num[i] == '০' :
            pass
        else:
            starting_point = i
            break     
    legit_number = just_num[starting_point:] 
    return legit_number  

def num_to_word(num):
    for word, initial in {"১":"1", "২":"2", "৩":"3", "৪":"4", "৫":"5", "৬":"6", "৭":"7", "৮":"8", "৯":"9", "০":"0"}.items():
        num_index = num.replace(word, initial)
    # with io.open('numberWords.txt', "r", encoding="utf-8") as WL:
    #     nums = WL.read() 
    nums = "শূন্য|এক|দুই|তিন|চার|পাঁচ|ছয়|সাত|আট|নয়|দশ|এগারো|বারো|তেরো|চৌদ্দ|পনেরো|ষোলো|সতেরো|আঠারো|উনিশ|বিশ|একুশ|বাইশ|তেইশ|চব্বিশ|পঁচিশ|ছাব্বিশ|সাতাশ|আটাশ|ঊনত্রিশ|ত্রিশ|একত্রিশ|বত্রিশ|তেত্রিশ|চৌত্রিশ|পঁয়ত্রিশ|ছত্রিশ|সাঁইত্রিশ|আটত্রিশ|ঊনচল্লিশ|চল্লিশ|একচল্লিশ|বিয়াল্লিশ|তেতাল্লিশ|চুয়াল্লিশ|পঁয়তাল্লিশ|ছেচল্লিশ|সাতচল্লিশ|আটচল্লিশ|ঊনপঞ্চাশ|পঞ্চাশ|একান্ন|বাহান্ন|তিপ্পান্ন|চুয়ান্ন|পঞ্চান্ন|ছাপ্পান্ন|সাতান্ন|আটান্ন|ঊনষাট|ষাট|একষট্টি|বাষট্টি|তেষট্টি|চৌষট্টি|পঁয়ষট্টি|ছেষট্টি|সাতষট্টি|আটষট্টি|ঊনসত্তর|সত্তর|একাত্তর|বাহাত্তর|তিয়াত্তর|চুয়াত্তর|পঁচাত্তর|ছিয়াত্তর|সাতাত্তর|আটাত্তর|ঊনআশি|আশি|একাশি|বিরাশি|তিরাশি|চুরাশি|পঁচাশি|ছিয়াশি|সাতাশি|অষ্টআশি|ঊননব্বই|নব্বই|একানব্বই|বিরানব্বই|তিরানব্বই|চুরানব্বই|পঁচানব্বই|ছিয়ানব্বই|সাতানব্বই|আটানব্বই|নিরানব্বই|একশো|একশো এক|একশো দুই|একশো তিন|একশো চার|একশো পাঁচ|একশো ছয়|একশো সাত|একশো আট|একশো নয়|একশো দশ|একশো এগারো|একশো বারো|একশো তেরো|একশো চৌদ্দ|একশো পনেরো|একশো ষোলো|একশো সতেরো|একশো আঠারো|একশো উনিশ|একশো বিশ|একশো একুশ|একশো বাইশ|একশো তেইশ|একশো চব্বিশ|একশো পঁচিশ|একশো ছাব্বিশ|একশো সাতাশ|একশো আটাশ|একশো ঊনত্রিশ|একশো ত্রিশ|একশো একত্রিশ|একশো বত্রিশ|একশো তেত্রিশ|একশো চৌত্রিশ|একশো পঁয়ত্রিশ|একশো ছত্রিশ|একশো সাঁইত্রিশ|একশো আটত্রিশ|একশো ঊনচল্লিশ|একশো চল্লিশ|একশো একচল্লিশ|একশো বিয়াল্লিশ|একশো তেতাল্লিশ|একশো চুয়াল্লিশ|একশো পঁয়তাল্লিশ|একশো ছেচল্লিশ|একশো সাতচল্লিশ|একশো আটচল্লিশ|একশো ঊনপঞ্চাশ|একশো পঞ্চাশ|একশো একান্ন|একশো বাহান্ন|একশো তিপ্পান্ন|একশো চুয়ান্ন|একশো পঞ্চান্ন|একশো ছাপ্পান্ন|একশো সাতান্ন|একশো আটান্ন|একশো ঊনষাট|একশো ষাট|একশো একষট্টি|একশো বাষট্টি|একশো তেষট্টি|একশো চৌষট্টি|একশো পঁয়ষট্টি|একশো ছেষট্টি|একশো সাতষট্টি|একশো আটষট্টি|একশো ঊনসত্তর|একশো সত্তর|একশো একাত্তর|একশো বাহাত্তর|একশো তিয়াত্তর|একশো চুয়াত্তর|একশো পঁচাত্তর|একশো ছিয়াত্তর|একশো সাতাত্তর|একশো আটাত্তর|একশো ঊনআশি|একশো আশি|একশো একাশি|একশো বিরাশি|একশো তিরাশি|একশো চুরাশি|একশো পঁচাশি|একশো ছিয়াশি|একশো সাতাশি|একশো অষ্টআশি|একশো ঊননব্বই|একশো নব্বই|একশো একানব্বই|একশো বিরানব্বই|একশো তিরানব্বই|একশো চুরানব্বই|একশো পঁচানব্বই|একশো ছিয়ানব্বই|একশো সাতানব্বই|একশো আটানব্বই|একশো নিরানব্বই|দুইশো|দুইশো এক|দুইশো দুই|দুইশো তিন|দুইশো চার|দুইশো পাঁচ|দুইশো ছয়|দুইশো সাত|দুইশো আট|দুইশো নয়|দুইশো দশ|দুইশো এগারো|দুইশো বারো|দুইশো তেরো|দুইশো চৌদ্দ|দুইশো পনেরো|দুইশো ষোলো|দুইশো সতেরো|দুইশো আঠারো|দুইশো উনিশ|দুইশো বিশ|দুইশো একুশ|দুইশো বাইশ|দুইশো তেইশ|দুইশো চব্বিশ|দুইশো পঁচিশ|দুইশো ছাব্বিশ|দুইশো সাতাশ|দুইশো আটাশ|দুইশো ঊনত্রিশ|দুইশো ত্রিশ|দুইশো একত্রিশ|দুইশো বত্রিশ|দুইশো তেত্রিশ|দুইশো চৌত্রিশ|দুইশো পঁয়ত্রিশ|দুইশো ছত্রিশ|দুইশো সাঁইত্রিশ|দুইশো আটত্রিশ|দুইশো ঊনচল্লিশ|দুইশো চল্লিশ|দুইশো একচল্লিশ|দুইশো বিয়াল্লিশ|দুইশো তেতাল্লিশ|দুইশো চুয়াল্লিশ|দুইশো পঁয়তাল্লিশ|দুইশো ছেচল্লিশ|দুইশো সাতচল্লিশ|দুইশো আটচল্লিশ|দুইশো ঊনপঞ্চাশ|দুইশো পঞ্চাশ|দুইশো একান্ন|দুইশো বাহান্ন|দুইশো তিপ্পান্ন|দুইশো চুয়ান্ন|দুইশো পঞ্চান্ন|দুইশো ছাপ্পান্ন|দুইশো সাতান্ন|দুইশো আটান্ন|দুইশো ঊনষাট|দুইশো ষাট|দুইশো একষট্টি|দুইশো বাষট্টি|দুইশো তেষট্টি|দুইশো চৌষট্টি|দুইশো পঁয়ষট্টি|দুইশো ছেষট্টি|দুইশো সাতষট্টি|দুইশো আটষট্টি|দুইশো ঊনসত্তর|দুইশো সত্তর|দুইশো একাত্তর|দুইশো বাহাত্তর|দুইশো তিয়াত্তর|দুইশো চুয়াত্তর|দুইশো পঁচাত্তর|দুইশো ছিয়াত্তর|দুইশো সাতাত্তর|দুইশো আটাত্তর|দুইশো ঊনআশি|দুইশো আশি|দুইশো একাশি|দুইশো বিরাশি|দুইশো তিরাশি|দুইশো চুরাশি|দুইশো পঁচাশি|দুইশো ছিয়াশি|দুইশো সাতাশি|দুইশো অষ্টআশি|দুইশো ঊননব্বই|দুইশো নব্বই|দুইশো একানব্বই|দুইশো বিরানব্বই|দুইশো তিরানব্বই|দুইশো চুরানব্বই|দুইশো পঁচানব্বই|দুইশো ছিয়ানব্বই|দুইশো সাতানব্বই|দুইশো আটানব্বই|দুইশো নিরানব্বই|তিনশো|তিনশো এক|তিনশো দুই|তিনশো তিন|তিনশো চার|তিনশো পাঁচ|তিনশো ছয়|তিনশো সাত|তিনশো আট|তিনশো নয়|তিনশো দশ|তিনশো এগারো|তিনশো বারো|তিনশো তেরো|তিনশো চৌদ্দ|তিনশো পনেরো|তিনশো ষোলো|তিনশো সতেরো|তিনশো আঠারো|তিনশো উনিশ|তিনশো বিশ|তিনশো একুশ|তিনশো বাইশ|তিনশো তেইশ|তিনশো চব্বিশ|তিনশো পঁচিশ|তিনশো ছাব্বিশ|তিনশো সাতাশ|তিনশো আটাশ|তিনশো ঊনত্রিশ|তিনশো ত্রিশ|তিনশো একত্রিশ|তিনশো বত্রিশ|তিনশো তেত্রিশ|তিনশো চৌত্রিশ|তিনশো পঁয়ত্রিশ|তিনশো ছত্রিশ|তিনশো সাঁইত্রিশ|তিনশো আটত্রিশ|তিনশো ঊনচল্লিশ|তিনশো চল্লিশ|তিনশো একচল্লিশ|তিনশো বিয়াল্লিশ|তিনশো তেতাল্লিশ|তিনশো চুয়াল্লিশ|তিনশো পঁয়তাল্লিশ|তিনশো ছেচল্লিশ|তিনশো সাতচল্লিশ|তিনশো আটচল্লিশ|তিনশো ঊনপঞ্চাশ|তিনশো পঞ্চাশ|তিনশো একান্ন|তিনশো বাহান্ন|তিনশো তিপ্পান্ন|তিনশো চুয়ান্ন|তিনশো পঞ্চান্ন|তিনশো ছাপ্পান্ন|তিনশো সাতান্ন|তিনশো আটান্ন|তিনশো ঊনষাট|তিনশো ষাট|তিনশো একষট্টি|তিনশো বাষট্টি|তিনশো তেষট্টি|তিনশো চৌষট্টি|তিনশো পঁয়ষট্টি|তিনশো ছেষট্টি|তিনশো সাতষট্টি|তিনশো আটষট্টি|তিনশো ঊনসত্তর|তিনশো সত্তর|তিনশো একাত্তর|তিনশো বাহাত্তর|তিনশো তিয়াত্তর|তিনশো চুয়াত্তর|তিনশো পঁচাত্তর|তিনশো ছিয়াত্তর|তিনশো সাতাত্তর|তিনশো আটাত্তর|তিনশো ঊনআশি|তিনশো আশি|তিনশো একাশি|তিনশো বিরাশি|তিনশো তিরাশি|তিনশো চুরাশি|তিনশো পঁচাশি|তিনশো ছিয়াশি|তিনশো সাতাশি|তিনশো অষ্টআশি|তিনশো ঊননব্বই|তিনশো নব্বই|তিনশো একানব্বই|তিনশো বিরানব্বই|তিনশো তিরানব্বই|তিনশো চুরানব্বই|তিনশো পঁচানব্বই|তিনশো ছিয়ানব্বই|তিনশো সাতানব্বই|তিনশো আটানব্বই|তিনশো নিরানব্বই|চারশো|চারশো এক|চারশো দুই|চারশো তিন|চারশো চার|চারশো পাঁচ|চারশো ছয়|চারশো সাত|চারশো আট|চারশো নয়|চারশো দশ|চারশো এগারো|চারশো বারো|চারশো তেরো|চারশো চৌদ্দ|চারশো পনেরো|চারশো ষোলো|চারশো সতেরো|চারশো আঠারো|চারশো উনিশ|চারশো বিশ|চারশো একুশ|চারশো বাইশ|চারশো তেইশ|চারশো চব্বিশ|চারশো পঁচিশ|চারশো ছাব্বিশ|চারশো সাতাশ|চারশো আটাশ|চারশো ঊনত্রিশ|চারশো ত্রিশ|চারশো একত্রিশ|চারশো বত্রিশ|চারশো তেত্রিশ|চারশো চৌত্রিশ|চারশো পঁয়ত্রিশ|চারশো ছত্রিশ|চারশো সাঁইত্রিশ|চারশো আটত্রিশ|চারশো ঊনচল্লিশ|চারশো চল্লিশ|চারশো একচল্লিশ|চারশো বিয়াল্লিশ|চারশো তেতাল্লিশ|চারশো চুয়াল্লিশ|চারশো পঁয়তাল্লিশ|চারশো ছেচল্লিশ|চারশো সাতচল্লিশ|চারশো আটচল্লিশ|চারশো ঊনপঞ্চাশ|চারশো পঞ্চাশ|চারশো একান্ন|চারশো বাহান্ন|চারশো তিপ্পান্ন|চারশো চুয়ান্ন|চারশো পঞ্চান্ন|চারশো ছাপ্পান্ন|চারশো সাতান্ন|চারশো আটান্ন|চারশো ঊনষাট|চারশো ষাট|চারশো একষট্টি|চারশো বাষট্টি|চারশো তেষট্টি|চারশো চৌষট্টি|চারশো পঁয়ষট্টি|চারশো ছেষট্টি|চারশো সাতষট্টি|চারশো আটষট্টি|চারশো ঊনসত্তর|চারশো সত্তর|চারশো একাত্তর|চারশো বাহাত্তর|চারশো তিয়াত্তর|চারশো চুয়াত্তর|চারশো পঁচাত্তর|চারশো ছিয়াত্তর|চারশো সাতাত্তর|চারশো আটাত্তর|চারশো ঊনআশি|চারশো আশি|চারশো একাশি|চারশো বিরাশি|চারশো তিরাশি|চারশো চুরাশি|চারশো পঁচাশি|চারশো ছিয়াশি|চারশো সাতাশি|চারশো অষ্টআশি|চারশো ঊননব্বই|চারশো নব্বই|চারশো একানব্বই|চারশো বিরানব্বই|চারশো তিরানব্বই|চারশো চুরানব্বই|চারশো পঁচানব্বই|চারশো ছিয়ানব্বই|চারশো সাতানব্বই|চারশো আটানব্বই|চারশো নিরানব্বই|পাঁচশো|পাঁচশো এক|পাঁচশো দুই|পাঁচশো তিন|পাঁচশো চার|পাঁচশো পাঁচ|পাঁচশো ছয়|পাঁচশো সাত|পাঁচশো আট|পাঁচশো নয়|পাঁচশো দশ|পাঁচশো এগারো|পাঁচশো বারো|পাঁচশো তেরো|পাঁচশো চৌদ্দ|পাঁচশো পনেরো|পাঁচশো ষোলো|পাঁচশো সতেরো|পাঁচশো আঠারো|পাঁচশো উনিশ|পাঁচশো বিশ|পাঁচশো একুশ|পাঁচশো বাইশ|পাঁচশো তেইশ|পাঁচশো চব্বিশ|পাঁচশো পঁচিশ|পাঁচশো ছাব্বিশ|পাঁচশো সাতাশ|পাঁচশো আটাশ|পাঁচশো ঊনত্রিশ|পাঁচশো ত্রিশ|পাঁচশো একত্রিশ|পাঁচশো বত্রিশ|পাঁচশো তেত্রিশ|পাঁচশো চৌত্রিশ|পাঁচশো পঁয়ত্রিশ|পাঁচশো ছত্রিশ|পাঁচশো সাঁইত্রিশ|পাঁচশো আটত্রিশ|পাঁচশো ঊনচল্লিশ|পাঁচশো চল্লিশ|পাঁচশো একচল্লিশ|পাঁচশো বিয়াল্লিশ|পাঁচশো তেতাল্লিশ|পাঁচশো চুয়াল্লিশ|পাঁচশো পঁয়তাল্লিশ|পাঁচশো ছেচল্লিশ|পাঁচশো সাতচল্লিশ|পাঁচশো আটচল্লিশ|পাঁচশো ঊনপঞ্চাশ|পাঁচশো পঞ্চাশ|পাঁচশো একান্ন|পাঁচশো বাহান্ন|পাঁচশো তিপ্পান্ন|পাঁচশো চুয়ান্ন|পাঁচশো পঞ্চান্ন|পাঁচশো ছাপ্পান্ন|পাঁচশো সাতান্ন|পাঁচশো আটান্ন|পাঁচশো ঊনষাট|পাঁচশো ষাট|পাঁচশো একষট্টি|পাঁচশো বাষট্টি|পাঁচশো তেষট্টি|পাঁচশো চৌষট্টি|পাঁচশো পঁয়ষট্টি|পাঁচশো ছেষট্টি|পাঁচশো সাতষট্টি|পাঁচশো আটষট্টি|পাঁচশো ঊনসত্তর|পাঁচশো সত্তর|পাঁচশো একাত্তর|পাঁচশো বাহাত্তর|পাঁচশো তিয়াত্তর|পাঁচশো চুয়াত্তর|পাঁচশো পঁচাত্তর|পাঁচশো ছিয়াত্তর|পাঁচশো সাতাত্তর|পাঁচশো আটাত্তর|পাঁচশো ঊনআশি|পাঁচশো আশি|পাঁচশো একাশি|পাঁচশো বিরাশি|পাঁচশো তিরাশি|পাঁচশো চুরাশি|পাঁচশো পঁচাশি|পাঁচশো ছিয়াশি|পাঁচশো সাতাশি|পাঁচশো অষ্টআশি|পাঁচশো ঊননব্বই|পাঁচশো নব্বই|পাঁচশো একানব্বই|পাঁচশো বিরানব্বই|পাঁচশো তিরানব্বই|পাঁচশো চুরানব্বই|পাঁচশো পঁচানব্বই|পাঁচশো ছিয়ানব্বই|পাঁচশো সাতানব্বই|পাঁচশো আটানব্বই|পাঁচশো নিরানব্বই|ছয়শো|ছয়শো এক|ছয়শো দুই|ছয়শো তিন|ছয়শো চার|ছয়শো পাঁচ|ছয়শো ছয়|ছয়শো সাত|ছয়শো আট|ছয়শো নয়|ছয়শো দশ|ছয়শো এগারো|ছয়শো বারো|ছয়শো তেরো|ছয়শো চৌদ্দ|ছয়শো পনেরো|ছয়শো ষোলো|ছয়শো সতেরো|ছয়শো আঠারো|ছয়শো উনিশ|ছয়শো বিশ|ছয়শো একুশ|ছয়শো বাইশ|ছয়শো তেইশ|ছয়শো চব্বিশ|ছয়শো পঁচিশ|ছয়শো ছাব্বিশ|ছয়শো সাতাশ|ছয়শো আটাশ|ছয়শো ঊনত্রিশ|ছয়শো ত্রিশ|ছয়শো একত্রিশ|ছয়শো বত্রিশ|ছয়শো তেত্রিশ|ছয়শো চৌত্রিশ|ছয়শো পঁয়ত্রিশ|ছয়শো ছত্রিশ|ছয়শো সাঁইত্রিশ|ছয়শো আটত্রিশ|ছয়শো ঊনচল্লিশ|ছয়শো চল্লিশ|ছয়শো একচল্লিশ|ছয়শো বিয়াল্লিশ|ছয়শো তেতাল্লিশ|ছয়শো চুয়াল্লিশ|ছয়শো পঁয়তাল্লিশ|ছয়শো ছেচল্লিশ|ছয়শো সাতচল্লিশ|ছয়শো আটচল্লিশ|ছয়শো ঊনপঞ্চাশ|ছয়শো পঞ্চাশ|ছয়শো একান্ন|ছয়শো বাহান্ন|ছয়শো তিপ্পান্ন|ছয়শো চুয়ান্ন|ছয়শো পঞ্চান্ন|ছয়শো ছাপ্পান্ন|ছয়শো সাতান্ন|ছয়শো আটান্ন|ছয়শো ঊনষাট|ছয়শো ষাট|ছয়শো একষট্টি|ছয়শো বাষট্টি|ছয়শো তেষট্টি|ছয়শো চৌষট্টি|ছয়শো পঁয়ষট্টি|ছয়শো ছেষট্টি|ছয়শো সাতষট্টি|ছয়শো আটষট্টি|ছয়শো ঊনসত্তর|ছয়শো সত্তর|ছয়শো একাত্তর|ছয়শো বাহাত্তর|ছয়শো তিয়াত্তর|ছয়শো চুয়াত্তর|ছয়শো পঁচাত্তর|ছয়শো ছিয়াত্তর|ছয়শো সাতাত্তর|ছয়শো আটাত্তর|ছয়শো ঊনআশি|ছয়শো আশি|ছয়শো একাশি|ছয়শো বিরাশি|ছয়শো তিরাশি|ছয়শো চুরাশি|ছয়শো পঁচাশি|ছয়শো ছিয়াশি|ছয়শো সাতাশি|ছয়শো অষ্টআশি|ছয়শো ঊননব্বই|ছয়শো নব্বই|ছয়শো একানব্বই|ছয়শো বিরানব্বই|ছয়শো তিরানব্বই|ছয়শো চুরানব্বই|ছয়শো পঁচানব্বই|ছয়শো ছিয়ানব্বই|ছয়শো সাতানব্বই|ছয়শো আটানব্বই|ছয়শো নিরানব্বই|সাতশো|সাতশো এক|সাতশো দুই|সাতশো তিন|সাতশো চার|সাতশো পাঁচ|সাতশো ছয়|সাতশো সাত|সাতশো আট|সাতশো নয়|সাতশো দশ|সাতশো এগারো|সাতশো বারো|সাতশো তেরো|সাতশো চৌদ্দ|সাতশো পনেরো|সাতশো ষোলো|সাতশো সতেরো|সাতশো আঠারো|সাতশো উনিশ|সাতশো বিশ|সাতশো একুশ|সাতশো বাইশ|সাতশো তেইশ|সাতশো চব্বিশ|সাতশো পঁচিশ|সাতশো ছাব্বিশ|সাতশো সাতাশ|সাতশো আটাশ|সাতশো ঊনত্রিশ|সাতশো ত্রিশ|সাতশো একত্রিশ|সাতশো বত্রিশ|সাতশো তেত্রিশ|সাতশো চৌত্রিশ|সাতশো পঁয়ত্রিশ|সাতশো ছত্রিশ|সাতশো সাঁইত্রিশ|সাতশো আটত্রিশ|সাতশো ঊনচল্লিশ|সাতশো চল্লিশ|সাতশো একচল্লিশ|সাতশো বিয়াল্লিশ|সাতশো তেতাল্লিশ|সাতশো চুয়াল্লিশ|সাতশো পঁয়তাল্লিশ|সাতশো ছেচল্লিশ|সাতশো সাতচল্লিশ|সাতশো আটচল্লিশ|সাতশো ঊনপঞ্চাশ|সাতশো পঞ্চাশ|সাতশো একান্ন|সাতশো বাহান্ন|সাতশো তিপ্পান্ন|সাতশো চুয়ান্ন|সাতশো পঞ্চান্ন|সাতশো ছাপ্পান্ন|সাতশো সাতান্ন|সাতশো আটান্ন|সাতশো ঊনষাট|সাতশো ষাট|সাতশো একষট্টি|সাতশো বাষট্টি|সাতশো তেষট্টি|সাতশো চৌষট্টি|সাতশো পঁয়ষট্টি|সাতশো ছেষট্টি|সাতশো সাতষট্টি|সাতশো আটষট্টি|সাতশো ঊনসত্তর|সাতশো সত্তর|সাতশো একাত্তর|সাতশো বাহাত্তর|সাতশো তিয়াত্তর|সাতশো চুয়াত্তর|সাতশো পঁচাত্তর|সাতশো ছিয়াত্তর|সাতশো সাতাত্তর|সাতশো আটাত্তর|সাতশো ঊনআশি|সাতশো আশি|সাতশো একাশি|সাতশো বিরাশি|সাতশো তিরাশি|সাতশো চুরাশি|সাতশো পঁচাশি|সাতশো ছিয়াশি|সাতশো সাতাশি|সাতশো অষ্টআশি|সাতশো ঊননব্বই|সাতশো নব্বই|সাতশো একানব্বই|সাতশো বিরানব্বই|সাতশো তিরানব্বই|সাতশো চুরানব্বই|সাতশো পঁচানব্বই|সাতশো ছিয়ানব্বই|সাতশো সাতানব্বই|সাতশো আটানব্বই|সাতশো নিরানব্বই|আটশো|আটশো এক|আটশো দুই|আটশো তিন|আটশো চার|আটশো পাঁচ|আটশো ছয়|আটশো সাত|আটশো আট|আটশো নয়|আটশো দশ|আটশো এগারো|আটশো বারো|আটশো তেরো|আটশো চৌদ্দ|আটশো পনেরো|আটশো ষোলো|আটশো সতেরো|আটশো আঠারো|আটশো উনিশ|আটশো বিশ|আটশো একুশ|আটশো বাইশ|আটশো তেইশ|আটশো চব্বিশ|আটশো পঁচিশ|আটশো ছাব্বিশ|আটশো সাতাশ|আটশো আটাশ|আটশো ঊনত্রিশ|আটশো ত্রিশ|আটশো একত্রিশ|আটশো বত্রিশ|আটশো তেত্রিশ|আটশো চৌত্রিশ|আটশো পঁয়ত্রিশ|আটশো ছত্রিশ|আটশো সাঁইত্রিশ|আটশো আটত্রিশ|আটশো ঊনচল্লিশ|আটশো চল্লিশ|আটশো একচল্লিশ|আটশো বিয়াল্লিশ|আটশো তেতাল্লিশ|আটশো চুয়াল্লিশ|আটশো পঁয়তাল্লিশ|আটশো ছেচল্লিশ|আটশো সাতচল্লিশ|আটশো আটচল্লিশ|আটশো ঊনপঞ্চাশ|আটশো পঞ্চাশ|আটশো একান্ন|আটশো বাহান্ন|আটশো তিপ্পান্ন|আটশো চুয়ান্ন|আটশো পঞ্চান্ন|আটশো ছাপ্পান্ন|আটশো সাতান্ন|আটশো আটান্ন|আটশো ঊনষাট|আটশো ষাট|আটশো একষট্টি|আটশো বাষট্টি|আটশো তেষট্টি|আটশো চৌষট্টি|আটশো পঁয়ষট্টি|আটশো ছেষট্টি|আটশো সাতষট্টি|আটশো আটষট্টি|আটশো ঊনসত্তর|আটশো সত্তর|আটশো একাত্তর|আটশো বাহাত্তর|আটশো তিয়াত্তর|আটশো চুয়াত্তর|আটশো পঁচাত্তর|আটশো ছিয়াত্তর|আটশো সাতাত্তর|আটশো আটাত্তর|আটশো ঊনআশি|আটশো আশি|আটশো একাশি|আটশো বিরাশি|আটশো তিরাশি|আটশো চুরাশি|আটশো পঁচাশি|আটশো ছিয়াশি|আটশো সাতাশি|আটশো অষ্টআশি|আটশো ঊননব্বই|আটশো নব্বই|আটশো একানব্বই|আটশো বিরানব্বই|আটশো তিরানব্বই|আটশো চুরানব্বই|আটশো পঁচানব্বই|আটশো ছিয়ানব্বই|আটশো সাতানব্বই|আটশো আটানব্বই|আটশো নিরানব্বই|নয়শো|নয়শো এক|নয়শো দুই|নয়শো তিন|নয়শো চার|নয়শো পাঁচ|নয়শো ছয়|নয়শো সাত|নয়শো আট|নয়শো নয়|নয়শো দশ|নয়শো এগারো|নয়শো বারো|নয়শো তেরো|নয়শো চৌদ্দ|নয়শো পনেরো|নয়শো ষোলো|নয়শো সতেরো|নয়শো আঠারো|নয়শো উনিশ|নয়শো বিশ|নয়শো একুশ|নয়শো বাইশ|নয়শো তেইশ|নয়শো চব্বিশ|নয়শো পঁচিশ|নয়শো ছাব্বিশ|নয়শো সাতাশ|নয়শো আটাশ|নয়শো ঊনত্রিশ|নয়শো ত্রিশ|নয়শো একত্রিশ|নয়শো বত্রিশ|নয়শো তেত্রিশ|নয়শো চৌত্রিশ|নয়শো পঁয়ত্রিশ|নয়শো ছত্রিশ|নয়শো সাঁইত্রিশ|নয়শো আটত্রিশ|নয়শো ঊনচল্লিশ|নয়শো চল্লিশ|নয়শো একচল্লিশ|নয়শো বিয়াল্লিশ|নয়শো তেতাল্লিশ|নয়শো চুয়াল্লিশ|নয়শো পঁয়তাল্লিশ|নয়শো ছেচল্লিশ|নয়শো সাতচল্লিশ|নয়শো আটচল্লিশ|নয়শো ঊনপঞ্চাশ|নয়শো পঞ্চাশ|নয়শো একান্ন|নয়শো বাহান্ন|নয়শো তিপ্পান্ন|নয়শো চুয়ান্ন|নয়শো পঞ্চান্ন|নয়শো ছাপ্পান্ন|নয়শো সাতান্ন|নয়শো আটান্ন|নয়শো ঊনষাট|নয়শো ষাট|নয়শো একষট্টি|নয়শো বাষট্টি|নয়শো তেষট্টি|নয়শো চৌষট্টি|নয়শো পঁয়ষট্টি|নয়শো ছেষট্টি|নয়শো সাতষট্টি|নয়শো আটষট্টি|নয়শো ঊনসত্তর|নয়শো সত্তর|নয়শো একাত্তর|নয়শো বাহাত্তর|নয়শো তিয়াত্তর|নয়শো চুয়াত্তর|নয়শো পঁচাত্তর|নয়শো ছিয়াত্তর|নয়শো সাতাত্তর|নয়শো আটাত্তর|নয়শো ঊনআশি|নয়শো আশি|নয়শো একাশি|নয়শো বিরাশি|নয়শো তিরাশি|নয়শো চুরাশি|নয়শো পঁচাশি|নয়শো ছিয়াশি|নয়শো সাতাশি|নয়শো অষ্টআশি|নয়শো ঊননব্বই|নয়শো নব্বই|নয়শো একানব্বই|নয়শো বিরানব্বই|নয়শো তিরানব্বই|নয়শো চুরানব্বই|নয়শো পঁচানব্বই|নয়শো ছিয়ানব্বই|নয়শো সাতানব্বই|নয়শো আটানব্বই|নয়শো নিরানব্বই"
    # num_word_list = nums.split ("|") 
    
    num_word_list = []
    w_list = nums.split ("|") 
    for w in w_list:
        num_word_list.append(w.replace('  ', ' '))
    
    try:    
        return num_word_list[int(num_index)]
    except Exception:
        return  

def lakh_semi_converter(given_number):
    given_number = modify_num(given_number) # this removes extra 0s 
    length_of_number = len(given_number)
    if length_of_number < 4:
        return_value = num_to_word(given_number)
        pass
    if length_of_number > 3 and length_of_number <6:
        hundred_range_num = given_number[-3:]
        hundred_num = f'{num_to_word(modify_num(hundred_range_num))}'

        thousend_range_num = given_number[-5:].replace(hundred_range_num, '')
        thousend_num = f'{num_to_word(modify_num(thousend_range_num))} হাজার'
        return_value = f'{thousend_num} {hundred_num}'   
    if  length_of_number > 5 and length_of_number <8:
        hundred_range_num = given_number[-3:]
        hundred_num = f'{num_to_word(modify_num(hundred_range_num))}শ'

        thousend_range_num = given_number[-5:].replace(hundred_range_num, '')
        thousend_num = f'{num_to_word(modify_num(thousend_range_num))} হাজার'
        
        lakh_range_num = given_number[-7:].replace(thousend_range_num+hundred_range_num, '')
        lakh_num = f'{num_to_word(modify_num(lakh_range_num))} লাখ' 
         
        return_value = f'{lakh_num} {thousend_num} {hundred_num}'
    return return_value    
                       
def convert_whole_number_to_word(given_number):
    length_of_number = len(given_number)
    if str(given_number[0]) == '1' or str(given_number[0]) == '১':
        if length_of_number == 4:
            sho_num = f'{num_to_word(given_number[0:2])} শ'
            j_num = num_to_word(given_number[2:4])
            return_value = f'{sho_num} {j_num}'
            return return_value
    if length_of_number < 4:
        # return_value = f'{num_to_word(given_number)}ত'
        return_value = num_to_word(given_number)
        pass
    if length_of_number > 3 and length_of_number <6:
        hundred_range_num = given_number[-3:]
        hundred_num = f'{num_to_word(modify_num(hundred_range_num))}'

        thousend_range_num = given_number[-5:].replace(hundred_range_num, '')
        thousend_num = f'{num_to_word(modify_num(thousend_range_num))} হাজার'
        return_value = f'{thousend_num} {hundred_num}'   
    if  length_of_number > 5 and length_of_number <8:
        hundred_range_num = given_number[-3:]
        hundred_num = f'{num_to_word(modify_num(hundred_range_num))}'

        thousend_range_num = given_number[-5:].replace(hundred_range_num, '')
        thousend_num = f'{num_to_word(modify_num(thousend_range_num))} হাজার'
        
        lakh_range_num = given_number[-7:].replace(thousend_range_num+hundred_range_num, '')
        lakh_num = f'{num_to_word(modify_num(lakh_range_num))} লাখ' 
         
        return_value = f'{lakh_num} {thousend_num} {hundred_num}'
    if length_of_number > 7:   
        lakh_number = lakh_semi_converter(modify_num(given_number[-7:]))
        lakh_num_range = given_number[-7:]
        corors_range = lakh_semi_converter(given_number.replace(lakh_num_range, ""))  
        return_value = f"{corors_range} কোটি {lakh_number}"
    return return_value

def convert_num_to_word(given_number):
    given_number = modify_num(given_number) # this removes extra 0s 
    if "." in given_number:
        index_of_dot = given_number.index('.')
        decimal_num_range = given_number[index_of_dot+1:]
        if decimal_num_range == "":
            given_number = given_number.replace('.', '')
            return_value = convert_whole_number_to_word(given_number)
        else:    
            decimal_num =""
            for i in range(len(decimal_num_range)):
                decimal_num += f'{num_to_word(decimal_num_range[i])} '
            whole_number = convert_whole_number_to_word(given_number.replace(given_number[index_of_dot:], ""))  
            return_value = f'{whole_number} দশমিক {decimal_num}'

    else:
        return_value = convert_whole_number_to_word(given_number)
    return return_value

# print(convert_num_to_word('৩,৬৪৩.৫০'))